/*
时间：2020/12/18 12:13
编辑人：chongqiu00
题目16：输入两个正整数 m 和 n，求其最大公约数和最小公倍数。
*/

#include <stdio.h>

int main (int argc, int* argv[])
{
    // int m, n;
    // int temp;

    // printf("请输入两个正整数m,n:");
    // scanf("%d%d", &m, &n);

    // //最大公约数1：辗转相除法
    // if (m<n)
    // {
    //     m = m ^ n;
    //     n = n ^ m;
    //     m = m ^ n;
    // }
    // while (m%n)
    // {
    //     temp = m % n;
    //     m = n;
    //     n = temp;
    // }

    // printf("%d\n", n);

    // //求最大公约数2：更相减损法
    // int a, b;
    // while (scanf("%d%d", &a, &b) != EOF)
    // {
    //     printf("%d,%d两数的最大公约数为:",a,b);
    //     while (a != b)
    //     {
    //         if (a > b)
    //             a = a - b;
    //         else
    //             b = b - a;
            
    //     }
    //     printf("%d\n", a);
    // }

    // //求最大公约数3：穷举法
    // int a,b,c;
	// while(scanf("%d%d",&a,&b)!=EOF)
	// {
	// 	int max=1;       //记录最大公约数 
	// 	c=a>b?b:a;      //c等于a和b中小的数 
	// 	for(int i=1;i<=c;i++)
	// 	{
	// 		if(a%i==0&&b%i==0)
	// 		{
	// 			if(i>max)
	// 				max=i;
	// 		}
	// 	}
	// 	printf("%d\n",max);
	// }

    //求最大公倍数
    //思路：先求出最大公约数。用两个数的乘积除以最大公约数即可。

    return 0;
}

/*
结论：
1.
EOP是文件流的结束标志，是一个宏，定义在 #include <stdio.h> 中，
#define EOP -1

2.
while(scanf("%d%d",&a,&b)!=EOF)
这样写可以避免死循还。

3.
求最大公约数：
方法一：欧几里得算法（辗转相除法）
    例子：453和36：
        453%36=21；
        36%21=15；
        21%15=6；
        15%6=3；
        6%3=0；
        得：3
方法二：更相减损法
    例子：453和36：
        453-36=417；
        417-36=381；
        381-363=345
        。。。。。
        9-6=3
        6-3=3
        3-3=0
        得：3
方法三：穷举法：找出其最小得数，从1开始到最小数全部遍历

4，
求最大公约数：
先求出最大公约数。用两个数的乘积除以最大公约数即可。

*/