/*
时间：2020/12/19 22:07
编辑人：chongqiu00
题目： 809*??=800*??+9*??+1 其中 ??代表的两位数 ,8*??的结果为两位数， 9*??的结果为 3 位数。求 ??代表的两位数，及
809*??后的结果。
*/

#include <stdio.h>

int main (int argc, int* argv[])
{
    int i;
    int k = 0;
    for (i=10; i<100; i++)
    {
       if (i*8>9 && i*8<100 && i*9>99 && i*9<1000)
       {
           if (809*i == 800*i + 9*i +1)
           {
               k = 1;
               printf("%d", i);
           }
       }
    }
    if (k == 0)
    {
        printf("不存在");
    }
   
    return 0;
}